/*木块*/
/*通用属性*/
/*anvilMaterial = "";//铁砧修复材料*/
/*containerItem = "";//乘装容器*/
creativeTab = "_Wood";//所在标签
damage = 0;//额外攻击力
effectiveBlocks = "";//能有速度加成采掘方块列表
enchantability = 0;//附魔加成
/*harvestBlocks = "";//能普通速度破坏方块列表*/
harvestLevel = 0;//挖掘等级
maxDamage = 0;//最大耐久
maxStack = 64//最大堆叠
name = "itemWood";//名称
toolClass = "pickaxe";//工具类型
full3d = false;//是否持剑型握物品
leaveContainerItem = false;//是否参与合成后残留在合成格中
repairable = false;//能否使用修复配方

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据0*/
/*属性*/
efficiency[0] = 1.0;//对应方块采掘速度加成
information[0] = "§8是块好燃料";//显示信息
maxUsingDuration[0] = 1;//使用物品最大时间
usingAction[0] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[0] = true;//是否添加到创造标签下
hasEffect[0] = false;//是否能附魔

/*贴图*/
textureFile[0] = "itemWood0.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据1*/
/*属性*/
efficiency[1] = 1.0;//对应方块采掘速度加成
information[1] = "§8你好像在哪见过";//显示信息
maxUsingDuration[1] = 1;//使用物品最大时间
usingAction[1] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[1] = true;//是否添加到创造标签下
hasEffect[1] = false;//是否能附魔

/*贴图*/
textureFile[1] = "itemWood1.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据2*/
/*属性*/
efficiency[2] = 1.0;//对应方块采掘速度加成
information[2] = "§8就像巧克力一样";//显示信息
maxUsingDuration[2] = 1;//使用物品最大时间
usingAction[2] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[2] = true;//是否添加到创造标签下
hasEffect[2] = false;//是否能附魔

/*贴图*/
textureFile[2] = "itemWood2.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据3*/
/*属性*/
efficiency[3] = 1.0;//对应方块采掘速度加成
information[3] = "§8一股来着可可的香味";//显示信息
maxUsingDuration[3] = 1;//使用物品最大时间
usingAction[3] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[3] = true;//是否添加到创造标签下
hasEffect[3] = false;//是否能附魔

/*贴图*/
textureFile[3] = "itemWood3.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据4*/
/*属性*/
efficiency[4] = 1.0;//对应方块采掘速度加成
information[4] = "§8貌似有点扎手";//显示信息
maxUsingDuration[4] = 1;//使用物品最大时间
usingAction[4] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[4] = true;//是否添加到创造标签下
hasEffect[4] = false;//是否能附魔

/*贴图*/
textureFile[4] = "itemWood4.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据5*/
/*属性*/
efficiency[5] = 1.0;//对应方块采掘速度加成
information[5] = "§8山重水复疑无路,柳暗花明又一村";//显示信息
maxUsingDuration[5] = 1;//使用物品最大时间
usingAction[5] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[5] = true;//是否添加到创造标签下
hasEffect[5] = false;//是否能附魔

/*贴图*/
textureFile[5] = "itemWood5.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据6*/
/*属性*/
efficiency[6] = 1.0;//对应方块采掘速度加成
information[6] = "§8硬邦邦~";//显示信息
maxUsingDuration[6] = 1;//使用物品最大时间
usingAction[6] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[6] = true;//是否添加到创造标签下
hasEffect[6] = false;//是否能附魔

/*贴图*/
textureFile[6] = "itemWood6.png";

/*触发器*/


