/*中块岩石*/
/*通用属性*/
/*anvilMaterial = "";//铁砧修复材料*/
/*containerItem = "";//乘装容器*/
creativeTab = "_Stone";//所在标签
damage = 0;//额外攻击力
effectiveBlocks = "";//能有速度加成采掘方块列表
enchantability = 0;//附魔加成
/*harvestBlocks = "";//能普通速度破坏方块列表*/
harvestLevel = 0;//挖掘等级
maxDamage = 0;//最大耐久
maxStack = 64//最大堆叠
name = "itemGravel_Normal";//名称
toolClass = "pickaxe";//工具类型
full3d = false;//是否持剑型握物品
leaveContainerItem = false;//是否参与合成后残留在合成格中
repairable = false;//能否使用修复配方

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据0*/
/*属性*/
efficiency[0] = 1.0;//对应方块采掘速度加成
information[0] = "§4未知岩石||§8来自§c腐殖土";//显示信息
maxUsingDuration[0] = 1;//使用物品最大时间
usingAction[0] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[0] = true;//是否添加到创造标签下
hasEffect[0] = false;//是否能附魔

/*贴图*/
textureFile[0] = "itemGravel_Normal0.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据1*/
/*属性*/
efficiency[1] = 1.0;//对应方块采掘速度加成
information[1] = "§4未知岩石||§8来自§1沼泽泥";//显示信息
maxUsingDuration[1] = 1;//使用物品最大时间
usingAction[1] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[1] = true;//是否添加到创造标签下
hasEffect[1] = false;//是否能附魔

/*贴图*/
textureFile[1] = "itemGravel_Normal1.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据2*/
/*属性*/
efficiency[2] = 1.0;//对应方块采掘速度加成
information[2] = "§4未知岩石||§8来自§2淤泥";//显示信息
maxUsingDuration[2] = 1;//使用物品最大时间
usingAction[2] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[2] = true;//是否添加到创造标签下
hasEffect[2] = false;//是否能附魔

/*贴图*/
textureFile[2] = "itemGravel_Normal2.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据3*/
/*属性*/
efficiency[3] = 1.0;//对应方块采掘速度加成
information[3] = "§4未知岩石||§8来自§3泥巴";//显示信息
maxUsingDuration[3] = 1;//使用物品最大时间
usingAction[3] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[3] = true;//是否添加到创造标签下
hasEffect[3] = false;//是否能附魔

/*贴图*/
textureFile[3] = "itemGravel_Normal3.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据4*/
/*属性*/
efficiency[4] = 1.0;//对应方块采掘速度加成
information[4] = "§4未知岩石||§8来自§5肥沃泥土";//显示信息
maxUsingDuration[4] = 1;//使用物品最大时间
usingAction[4] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[4] = true;//是否添加到创造标签下
hasEffect[4] = false;//是否能附魔

/*贴图*/
textureFile[4] = "itemGravel_Normal4.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据5*/
/*属性*/
efficiency[5] = 1.0;//对应方块采掘速度加成
information[5] = "§4未知岩石||§8来自§6泥土";//显示信息
maxUsingDuration[5] = 1;//使用物品最大时间
usingAction[5] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[5] = true;//是否添加到创造标签下
hasEffect[5] = false;//是否能附魔

/*贴图*/
textureFile[5] = "itemGravel_Normal5.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据6*/
/*属性*/
efficiency[6] = 1.0;//对应方块采掘速度加成
information[6] = "§4未知岩石||§8来自§d干燥泥土";//显示信息
maxUsingDuration[6] = 1;//使用物品最大时间
usingAction[6] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[6] = true;//是否添加到创造标签下
hasEffect[6] = false;//是否能附魔

/*贴图*/
textureFile[6] = "itemGravel_Normal6.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据7*/
/*属性*/
efficiency[7] = 1.0;//对应方块采掘速度加成
information[7] = "§4未知岩石||§8来自§9硬化泥土";//显示信息
maxUsingDuration[7] = 1;//使用物品最大时间
usingAction[7] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[7] = true;//是否添加到创造标签下
hasEffect[7] = false;//是否能附魔

/*贴图*/
textureFile[7] = "itemGravel_Normal7.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据8*/
/*属性*/
efficiency[8] = 1.0;//对应方块采掘速度加成
information[8] = "§4未知岩石||§8来自§a沙质泥土";//显示信息
maxUsingDuration[8] = 1;//使用物品最大时间
usingAction[8] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[8] = true;//是否添加到创造标签下
hasEffect[8] = false;//是否能附魔

/*贴图*/
textureFile[8] = "itemGravel_Normal8.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据9*/
/*属性*/
efficiency[9] = 1.0;//对应方块采掘速度加成
information[9] = "§4未知岩石||§8来自§b粗沙";//显示信息
maxUsingDuration[9] = 1;//使用物品最大时间
usingAction[9] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[9] = true;//是否添加到创造标签下
hasEffect[9] = false;//是否能附魔

/*贴图*/
textureFile[9] = "itemGravel_Normal9.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据10*/
/*属性*/
efficiency[10] = 1.0;//对应方块采掘速度加成
information[10] = "§4未知岩石||§8来自§c沙子";//显示信息
maxUsingDuration[10] = 1;//使用物品最大时间
usingAction[10] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[10] = true;//是否添加到创造标签下
hasEffect[10] = false;//是否能附魔

/*贴图*/
textureFile[10] = "itemGravel_Normal10.png";

/*触发器*/

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
/*元数据11*/
/*属性*/
efficiency[11] = 1.0;//对应方块采掘速度加成
information[11] = "§4未知岩石||§8来自§d流沙";//显示信息
maxUsingDuration[11] = 1;//使用物品最大时间
usingAction[11] = "block";//使用时玩家动作

/*布尔值*/
addToCreative[11] = true;//是否添加到创造标签下
hasEffect[11] = false;//是否能附魔

/*贴图*/
textureFile[11] = "itemGravel_Normal11.png";

/*触发器*/
